cases/Single_Assembly/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version    2.0;
    format     ascii;
    class      volScalarField;
    object     T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions           [0 0 0 1 0 0 0];

internalField        uniform 568.85;

boundaryField
{
    INLET
    {
        type         fixedValue;
        value        uniform 568.85;
    }

    OUTLET
    {
        //type        zeroGradient;

        type              inletOutlet;
        inletValue        uniform 568.85;
        value             uniform 568.85;
    }

    WALL
    {
        type        zeroGradient;
    }
}

// ************************************************************************* //


