cases/Single_Assembly/constant/ReactorCore
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      ReactorCore;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CoreMapDimension               15;

CenterAssemblyXIndex           8;

CenterAssemblyYIndex           8;

AssemblyWidth                  0.215;

pitch                          0.0126;

CorrectRodArrangement          yes;

TestCaseWithAssemblyBox        no;

AssemblyRodsDimension          17;

RodOuterDiameter               0.01;

MixingCoefficient              0.0035;


Core_type_z_direction
1
(1);


Core_height_z_direction
1
(20.00);


CoreAssemblyDistribution
15
(
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  1  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
15( 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0 )
);


CoreAssemblyPowerDistributionFactor
15
(
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  1.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
15( 0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000  0.0000 )
);


AssemblyRodLayout
17
(
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  1  1  1  0  1  1  0  1  1  0  1  1  1  1  1 )
17( 1  1  1  0  1  1  1  1  1  1  1  1  1  0  1  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  0  1  1  0  1  1  0  1  1  0  1  1  0  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  0  1  1  0  1  1  0  1  1  0  1  1  0  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  0  1  1  0  1  1  0  1  1  0  1  1  0  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  1  0  1  1  1  1  1  1  1  1  1  0  1  1  1 )
17( 1  1  1  1  1  0  1  1  0  1  1  0  1  1  1  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
17( 1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1  1 )
);


RodPinPowerDistributionFactor
17
(
17( 0.943  0.938  0.942  0.952  0.962  0.972  0.970  0.971  0.975  0.971  0.970  0.972  0.962  0.952  0.942  0.938  0.943 )
17( 0.938  0.936  0.945  0.963  0.983  1.011  0.988  0.988  1.011  0.988  0.988  1.011  0.983  0.963  0.945  0.936  0.938 )
17( 0.942  0.945  0.973  1.017  1.038  0.000  1.028  1.027  0.000  1.027  1.028  0.000  1.038  1.017  0.973  0.945  0.942 )
17( 0.952  0.963  1.017  0.000  1.054  1.047  1.011  1.007  1.033  1.007  1.011  1.047  1.054  0.000  1.017  0.963  0.952 )
17( 0.962  0.983  1.038  1.054  1.036  1.047  1.014  1.011  1.037  1.011  1.014  1.047  1.036  1.054  1.038  0.983  0.962 )
17( 0.972  1.011  0.000  1.047  1.047  0.000  1.040  1.038  0.000  1.038  1.040  0.000  1.047  1.047  0.000  1.011  0.972 )
17( 0.970  0.988  1.028  1.011  1.014  1.040  1.013  1.012  1.039  1.012  1.013  1.040  1.014  1.011  1.028  0.988  0.970 )
17( 0.971  0.988  1.027  1.007  1.011  1.038  1.012  1.012  1.038  1.012  1.012  1.038  1.011  1.007  1.027  0.988  0.971 )
17( 0.975  1.011  0.000  1.033  1.037  0.000  1.039  1.038  0.000  1.038  1.039  0.000  1.037  1.033  0.000  1.011  0.975 )
17( 0.971  0.988  1.027  1.007  1.011  1.038  1.012  1.012  1.038  1.012  1.012  1.038  1.011  1.007  1.027  0.988  0.971 )
17( 0.970  0.988  1.028  1.011  1.014  1.040  1.013  1.012  1.039  1.012  1.013  1.040  1.014  1.011  1.028  0.988  0.970 )
17( 0.972  1.011  0.000  1.047  1.047  0.000  1.040  1.038  0.000  1.038  1.040  0.000  1.047  1.047  0.000  1.011  0.972 )
17( 0.962  0.983  1.038  1.054  1.036  1.047  1.014  1.011  1.037  1.011  1.014  1.047  1.036  1.054  1.038  0.983  0.962 )
17( 0.952  0.963  1.017  0.000  1.054  1.047  1.011  1.007  1.033  1.007  1.011  1.047  1.054  0.000  1.017  0.963  0.952 )
17( 0.942  0.945  0.973  1.017  1.038  0.000  1.028  1.027  0.000  1.027  1.028  0.000  1.038  1.017  0.973  0.945  0.942 )
17( 0.938  0.936  0.945  0.963  0.983  1.011  0.988  0.988  1.011  0.988  0.988  1.011  0.983  0.963  0.945  0.936  0.938 )
17( 0.943  0.938  0.942  0.952  0.962  0.972  0.970  0.971  0.975  0.971  0.970  0.972  0.962  0.952  0.942  0.938  0.943 )
);


// ************************************************************************* //


