cases/Single_Assembly/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    ( -0.1075  -0.1075   0.0000 )
    ( -0.1075   0.1075   0.0000 )
    (  0.1075   0.1075   0.0000 )
    (  0.1075  -0.1075   0.0000 )


    ( -0.1075  -0.1075   0.1550 )
    ( -0.1075   0.1075   0.1550 )
    (  0.1075   0.1075   0.1550 )
    (  0.1075  -0.1075   0.1550 )


    ( -0.1075  -0.1075   0.6280 )
    ( -0.1075   0.1075   0.6280 )
    (  0.1075   0.1075   0.6280 )
    (  0.1075  -0.1075   0.6280 )


    ( -0.1075  -0.1075   0.6610 )
    ( -0.1075   0.1075   0.6610 )
    (  0.1075   0.1075   0.6610 )
    (  0.1075  -0.1075   0.6610 )


    ( -0.1075  -0.1075   1.1330 )
    ( -0.1075   0.1075   1.1330 )
    (  0.1075   0.1075   1.1330 )
    (  0.1075  -0.1075   1.1330 )


    ( -0.1075  -0.1075   1.1660 )
    ( -0.1075   0.1075   1.1660 )
    (  0.1075   0.1075   1.1660 )
    (  0.1075  -0.1075   1.1660 )


    ( -0.1075  -0.1075   1.6380 )
    ( -0.1075   0.1075   1.6380 )
    (  0.1075   0.1075   1.6380 )
    (  0.1075  -0.1075   1.6380 )


    ( -0.1075  -0.1075   1.6710 )
    ( -0.1075   0.1075   1.6710 )
    (  0.1075   0.1075   1.6710 )
    (  0.1075  -0.1075   1.6710 )


    ( -0.1075  -0.1075   2.1440 )
    ( -0.1075   0.1075   2.1440 )
    (  0.1075   0.1075   2.1440 )
    (  0.1075  -0.1075   2.1440 )


    ( -0.1075  -0.1075   2.1770 )
    ( -0.1075   0.1075   2.1770 )
    (  0.1075   0.1075   2.1770 )
    (  0.1075  -0.1075   2.1770 )


    ( -0.1075  -0.1075   2.6490 )
    ( -0.1075   0.1075   2.6490 )
    (  0.1075   0.1075   2.6490 )
    (  0.1075  -0.1075   2.6490 )


    ( -0.1075  -0.1075   2.6820 )
    ( -0.1075   0.1075   2.6820 )
    (  0.1075   0.1075   2.6820 )
    (  0.1075  -0.1075   2.6820 )


    ( -0.1075  -0.1075   3.1550 )
    ( -0.1075   0.1075   3.1550 )
    (  0.1075   0.1075   3.1550 )
    (  0.1075  -0.1075   3.1550 )


    ( -0.1075  -0.1075   3.1880 )
    ( -0.1075   0.1075   3.1880 )
    (  0.1075   0.1075   3.1880 )
    (  0.1075  -0.1075   3.1880 )


    ( -0.1075  -0.1075   3.6610 )
    ( -0.1075   0.1075   3.6610 )
    (  0.1075   0.1075   3.6610 )
    (  0.1075  -0.1075   3.6610 )


    ( -0.1075  -0.1075   3.6940 )
    ( -0.1075   0.1075   3.6940 )
    (  0.1075   0.1075   3.6940 )
    (  0.1075  -0.1075   3.6940 )


    ( -0.1075  -0.1075   4.1660 )
    ( -0.1075   0.1075   4.1660 )
    (  0.1075   0.1075   4.1660 )
    (  0.1075  -0.1075   4.1660 )


    ( -0.1075  -0.1075   4.1990 )
    ( -0.1075   0.1075   4.1990 )
    (  0.1075   0.1075   4.1990 )
    (  0.1075  -0.1075   4.1990 )


);

blocks
(
        hex (    0   3   2   1   4   7   6   5)   ( 18 18   1) simpleGrading (1 1 1)
        hex (    4   7   6   5   8  11  10   9)   ( 18 18   4) simpleGrading (1 1 1)
        hex (    8  11  10   9  12  15  14  13)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   12  15  14  13  16  19  18  17)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   16  19  18  17  20  23  22  21)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   20  23  22  21  24  27  26  25)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   24  27  26  25  28  31  30  29)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   28  31  30  29  32  35  34  33)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   32  35  34  33  36  39  38  37)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   36  39  38  37  40  43  42  41)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   40  43  42  41  44  47  46  45)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   44  47  46  45  48  51  50  49)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   48  51  50  49  52  55  54  53)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   52  55  54  53  56  59  58  57)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   56  59  58  57  60  63  62  61)   ( 18 18   1) simpleGrading (1 1 1)
        hex (   60  63  62  61  64  67  66  65)   ( 18 18   4) simpleGrading (1 1 1)
        hex (   64  67  66  65  68  71  70  69)   ( 18 18   1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    OUTLET
    {
        type wall;
        faces
        (
            (  71  70  69  68 )
        );
    }
    INLET
    {
        type wall;
        faces
        (
            (   0   1   2   3 )
        );
    }
    WALL
    {
        type wall;
        //type empty;
        faces
        (
            (   0   4   5   1 )
            (   1   5   6   2 )
            (   2   6   7   3 )
            (   3   7   4   0 )

            (   4   8   9   5 )
            (   5   9  10   6 )
            (   6  10  11   7 )
            (   7  11   8   4 )

            (   8  12  13   9 )
            (   9  13  14  10 )
            (  10  14  15  11 )
            (  11  15  12   8 )

            (  12  16  17  13 )
            (  13  17  18  14 )
            (  14  18  19  15 )
            (  15  19  16  12 )

            (  16  20  21  17 )
            (  17  21  22  18 )
            (  18  22  23  19 )
            (  19  23  20  16 )

            (  20  24  25  21 )
            (  21  25  26  22 )
            (  22  26  27  23 )
            (  23  27  24  20 )

            (  24  28  29  25 )
            (  25  29  30  26 )
            (  26  30  31  27 )
            (  27  31  28  24 )

            (  28  32  33  29 )
            (  29  33  34  30 )
            (  30  34  35  31 )
            (  31  35  32  28 )

            (  32  36  37  33 )
            (  33  37  38  34 )
            (  34  38  39  35 )
            (  35  39  36  32 )

            (  36  40  41  37 )
            (  37  41  42  38 )
            (  38  42  43  39 )
            (  39  43  40  36 )

            (  40  44  45  41 )
            (  41  45  46  42 )
            (  42  46  47  43 )
            (  43  47  44  40 )

            (  44  48  49  45 )
            (  45  49  50  46 )
            (  46  50  51  47 )
            (  47  51  48  44 )

            (  48  52  53  49 )
            (  49  53  54  50 )
            (  50  54  55  51 )
            (  51  55  52  48 )

            (  52  56  57  53 )
            (  53  57  58  54 )
            (  54  58  59  55 )
            (  55  59  56  52 )

            (  56  60  61  57 )
            (  57  61  62  58 )
            (  58  62  63  59 )
            (  59  63  60  56 )

            (  60  64  65  61 )
            (  61  65  66  62 )
            (  62  66  67  63 )
            (  63  67  64  60 )

            (  64  68  69  65 )
            (  65  69  70  66 )
            (  66  70  71  67 )
            (  67  71  68  64 )

        );
    }
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


